implement-verify-service/test-results/csharp-repo/pipeline-output/dotnet-eShop/test/diagrams/component-diagram.mmd
graph LR
    src["src"] --> System["System"]
    src["src"] --> eShop["eShop"]
    src["src"] --> global_System["global System"]
    src["src"] --> global_Grpc["global Grpc"]
    src["src"] --> global_Microsoft["global Microsoft"]
    src["src"] --> global_eShop["global eShop"]
    src["src"] --> global_StackExchange["global StackExchange"]
    src["src"] --> Microsoft["Microsoft"]
    src["src"] --> Pgvector["Pgvector"]
    src["src"] --> global_Asp["global Asp"]
    src["src"] --> global_Npgsql["global Npgsql"]
    src["src"] --> Npgsql["Npgsql"]
    src["src"] --> Asp["Asp"]
